Repository: pchaganti/gx-sidekick
Catalog: Sidekick/Localizable.xcstrings
Source language: en
Languages: zh_hans

# Processing resource %lld of %lld
source: Processing resource %1$lld of %2$lld
zh_hans: 正在处理资源 %1$lld，共 %2$lld

source: Processing...
zh_hans: 正在处理…

source: Progress: %@
zh_hans: 进度：%@

source: Projector Model: %@
zh_hans: 投影器： %@

source: Prompt
zh_hans: 提示

source: Provider Changed
zh_hans: 新端点

source: Re-index all resources with graph extraction. This may take several minutes.
zh_hans: 使用图谱提取重新索引所有资源。这可能需要几分钟时间。

source: Reasoning Process
zh_hans: 思考过程

source: Rebuild Knowledge Graph
zh_hans: 重建知识图谱

source: Recommended values:
zh_hans: 推荐温度数值：

source: References:
zh_hans: 参考资料：

source: Refresh
zh_hans: 刷新

source: Reminders
zh_hans: 提醒

source: Remote Inference
zh_hans: 远端推理

source: Remote Model
zh_hans: 远端模型

source: Remote Models
zh_hans: 远端模型

source: Remote Worker Model
zh_hans: 远端极速模型

source: Remove
zh_hans: 移除

source: Remove Resources
zh_hans: 移除资源

source: Rename
zh_hans: 编辑命名

source: Report an Issue
zh_hans: 提交问题报告

source: Requirements
zh_hans: 硬件要求

source: Research each section
zh_hans: 研究每一部分

source: Research Report Sections
zh_hans: 研究报告章节

source: Researched Section "%@"
zh_hans: 已调查 "%@"

source: Resource Type
zh_hans: 资源类型

source: Resources
zh_hans: 资源

source: Resources Search
zh_hans: 资源搜索

source: Resources:
zh_hans: 资源：

source: Response
zh_hans: 回复形式

source: Restart Sidekick
zh_hans: 重启 Sidekick

source: Restore
zh_hans: 恢复

source: Restore Conversations from Backup
zh_hans: 恢复对话备份

source: Result:
zh_hans: 返回结果:

source: Retrieval
zh_hans: 搜索

source: Retrieving knowledge...
zh_hans: 正在检索知识...

source: Retry
zh_hans: 重试

source: Rewrite
zh_hans: 重写

source: Rewrite the text below into bullet points: ""
zh_hans: 请将这段文字重写为要点： “”

source: Rewrite the text below. Respond in the same language as the original text.
zh_hans: 重写下面的文字。使用与原文相同的语言进行回复。

source: Save
zh_hans: 保存

source: Save as HTML
zh_hans: 保存为网页

source: Save as Text
zh_hans: 保存为文字

source: Say hi
zh_hans: 你好！

source: Scatter Plot
zh_hans: 散点图

source: Scientific Method
zh_hans: 科学方法

source: Search
zh_hans: 搜索

source: Search is not configured properly in Settings
zh_hans: 搜索配置错误。

source: Search is not configured properly. Please configure it in "Settings" -> "Retrieval".
zh_hans: 搜索未正确配置。请在“设置”->“搜索”中进行配置。

source: Search is not configured. Please configure it in "Settings" -> "Retrieval".
zh_hans: 未设置搜索。请在“设置”->“搜索”中进行配置。

source: Search Memories
zh_hans: 搜索记忆

source: Search not configured
zh_hans: 未设置搜索

source: Search Provider
zh_hans: 搜索引擎

source: Search Result Context
zh_hans: 搜索结果上下文

source: Search Results
zh_hans: 搜索结果

source: Search the web to find up to date information about a topic.
zh_hans: 在互联网上搜索，以找到最新相关信息。

source: Searching...
zh_hans: 正在搜索…

source: Select
zh_hans: 选择

source: Select a Base Model
zh_hans: 选择基座模型

source: Select a family of models from the sidebar
zh_hans: 从侧边栏中选择一个系列

source: Select a File
zh_hans: 请选择文件

source: Select a Folder
zh_hans: 选择文件夹

source: Select a Model
zh_hans: 选择一个模型

source: Select a Save Location
zh_hans: 请选择文件夹

source: Select All
zh_hans: 全选

source: Select an Email Address:
zh_hans: 选择一个邮箱：

source: Select an Expert
zh_hans: 选择专家

source: Select Files or Folders
zh_hans: 请选择文件或文件夹

source: Select the search provider used for web search.
zh_hans: 选择用于网页搜索的搜索引擎。

source: Send a message with the selected shortcut.
zh_hans: 使用选定的快捷键发送消息。

source: Send Message
zh_hans: 发送消息

source: Sentences driving %@ probability:
zh_hans: 导向%@概率的句子：

source: Set Inference Settings to Defaults
zh_hans: 重置所有推理设置

source: Set Up
zh_hans: 配置

source: Settings
zh_hans: 设置

source: Shortcut
zh_hans: 快捷键

source: Show a line chart of average monthly temperatures in a city. Use hypothetical data.
zh_hans: 请展示某城市月平均气温的条形图和折线图。请使用假设的数据。

source: Show a pie chart of favorite foods among students in a classroom. Use hypothetical data.
zh_hans: 展示一个班级学生中最喜爱食物的饼图。

source: Show all %lld lines
zh_hans: 展开剩余 %lld 行

source: Show Container in Finder
zh_hans: 在访达中显示容器

source: Show in Finder
zh_hans: 在访达中显示

source: Show less
zh_hans: 收起

source: Sidekick can call functions to obtain information from other applications and perform tasks. For example, when asked to reschedule a meeting, Sidekick can get all events from your calendar, find an available time slot, and then reschedule the meeting by creating a calendar event and drafting an email.
zh_hans: Sidekick可以调用函数从其他应用程序获取信息并执行任务。例如，当被要求重新安排会议时，Sidekick可以从你的日历中获取所有事件，找到一个可用的时间段，然后通过创建日历事件和起草电子邮件重新安排会议。

source: Sidekick has adopted OpenAI's API endpoint format. Please navigate to `Settings` -> `Inference` and update your endpoint to end with `/v1`.
zh_hans: Sidekick已经采用了OpenAI的API端点格式。请前往`设置` -> `推理`并更新你的端点使其以`/v1`结尾。

source: Sidekick is ready to use.
zh_hans: Sidekick 已可供使用。

source: Sidekick needs permission to read your emails in Apple Mail. Please click the button below and press "Open".
zh_hans: Sidekick 需要权限才能阅读 Apple Mail 中的电子邮件。请点击下面的按钮并按“打开”。

source: Sidekick remembers useful details about you and
zh_hans: Sidekick会记住关于你和你的偏好和

source: Sidekick wants to run the function `%1$@` to complete your request with the parameters below. %2$@ Do you wish to permit this?
zh_hans: Sidekick需要启用 `%1$@` 函数处理您的请求。该函数运行的参数如下。 %2$@ 您是否允许此操作？

source: Sidekick will refer to you by this username.
zh_hans: Sidekick 将使用此名称称呼你

source: Sidekick's Inline Writing Assistant is enabled by default.
zh_hans: 默认启用 Sidekick 的写作助手。

source: Simplify
zh_hans: 简化

source: Simplify the text below for a general audience, removing techinical jargon and hard-to-grasp ideas. Respond in the same language as the original text.
zh_hans: 为普通读者简化以下文本，删除技术术语和难以理解的想法。使用与原文相同的语言进行回复。

source: Skip
zh_hans: 掠过教程

source: Slide Studio
zh_hans: 演示文稿生成

source: Slides: %lld
zh_hans: 页数：%lld

source: Sources
zh_hans: 资料来源

source: Speed (t/s)
zh_hans: 速度（每秒令牌数）

source: Start Time
zh_hans: 开始时间

source: Stats for Nerds
zh_hans: 数据

source: Stay one step ahead of Turnitin
zh_hans: 知己知彼，百战百胜

source: Summarize
zh_hans: 总结

source: Summarize the text below: ""
zh_hans: 总结这段文字： “”

source: Supply and Demand
zh_hans: 供需原理

source: Symbol:
zh_hans: 符号：

source: System Prompt
zh_hans: 系统提示

source: Table
zh_hans: 列表

source: Teach me
zh_hans: 教我

source: Teach me how to
zh_hans: 教我如何

source: Temperature
zh_hans: 温度

source: Temperature is a parameter that influences LLM output, determining whether it is more random and creative or more predictable. The lower the setting the more predictable the model acts.
zh_hans: 温度是影响模型输出的一个参数，决定其输出是更加随机、更具创造性还是更加可预测。更低的温度往往会令输出更随机，更有创造性。

source: Temperatures
zh_hans: 温度变化

source: Text
zh_hans: 生成文字

source: Text is not long enough to evaluate.
zh_hans: 词条过短，无法评估。

source: The AI is on strike!
zh_hans: 模型罢工了！

source: The context window was exceeded. Sidekick will automatically compress tool results and retry. %@
zh_hans: 上下文窗口已超出。Sidekick 将自动压缩工具结果并重试。 %@

source: The endpoint on the server used for inference. This endpoint must be accessible from this device, and provide an OpenAI compatible API. (e.g. http://localhost:8000/v1/, where http://localhost:8000/v1/chat/completions is accessible) To ensure privacy and security of your data, host your own server.
zh_hans: 用于推理的服务器上的端点。此端点必须可从此设备访问，并提供与 OpenAI 兼容的 API。 （例如 http://localhost:11434/v1，其中 http://localhost:11434/v1/chat/completions 可被访问） 为保障隐私和数据安全，我们建议你托管您自己的服务器。

source: The file format of the exported slideshow
zh_hans: 导出幻灯片的文件格式

source: The filename of the exported file
zh_hans: 导出文件的文件名

source: The local AI model couldn't be found, and Sidekick could not connect to a remote server. Please verify that the local and server models are configured correctly in Settings.
zh_hans: 未找到本地 AI 模型，且 Sidekick 无法连接远程服务器。请确认本地和服务器模型已在设置中正确配置。

source: The model's name. (e.g. gpt-5)
zh_hans: 模型名称（如：gpt-5）

source: The name of the exported slideshow
zh_hans: 幻灯片名称

source: The name of the folder containing the site
zh_hans: 保存网页的文件夹名称

source: The network connection was lost. The request will be automatically retried. %@
zh_hans: 网络连接已断开。系统将自动重试请求。 %@

source: The resources %@ were removed because they could not be located.
zh_hans: 由于Sidekick 无法找到%@，相关的资源已被清除。

source: The shortcut used to accept the full completion suggestion.
zh_hans: 用于接受整段文本续写建议的快捷方式。

source: The shortcut used to accept the next word in completion suggestions.
zh_hans: 用于接受文本续写建议中的下一个单词的快捷方式。

source: The shortcut used to trigger and dismiss inline writing assistant commands.
zh_hans: 用于触发和关闭写作助手命令的快捷指令。

source: The threshold for displayed completion suggestions.
zh_hans: 显示文本续写建议的阈值。

source: The voice used to read responses aloud. Download voices in [System Settings -> Accessibility](x-apple.systempreferences:com.apple.preference.universalaccess?SpeakableItems) -> Spoken Content -> System Voice -> Manage Voices.
zh_hans: 用于大声朗读回复的声音。

source: The worker model's name. (e.g. gpt-5-mini) The worker model is used for simpler tasks like generating chat titles. Leave this blank to use the main model for all tasks.
zh_hans: 极速模型的名称。（如：gpt-5-mini）极速模型用于生成聊天标题等较简单的任务。 将此栏目留空，以使用主模型执行所有任务。

source: Thinking...
zh_hans: 正在思考…

source: This command's name
zh_hans: 这项指令的名称

source: This command's prompt
zh_hans: 这项指令的提示

source: This expert's icon
zh_hans: 此专家的图标

source: This expert's name
zh_hans: 此专家的名称

source: This expert's system prompt
zh_hans: 系统提示是模型的初始或持续输入，指导交互的方向或向用户请求特定信息。

source: This icon's color
zh_hans: 此图标的颜色

source: This icon's symbol
zh_hans: 此图标的符号

source: This is the default local model used.
zh_hans: 默认使用的本地模型

source: This is the local worker model used for simpler tasks like generating chat titles.
zh_hans: 极速模型会哦呗用于生成聊天标题等较简单的任务。

source: This is the model used for speculative decoding. It should be in the same family as the main model, but with less parameters.
zh_hans: 这是用于推测性解码的本地模型。它的参数量应该比主模型少。

source: This is the multimodal projector corresponding to the selected local model, which handles image encoding and projection.
zh_hans: 这是对应于选定的本地模型的多模态投影器，处理图像编码和投影。

source: This is the selected base model, which handles text completions.
zh_hans: 这是用于文本续写的基座模型。

source: This Month
zh_hans: 本月

source: This Week
zh_hans: 本周

source: This Year
zh_hans: 本年

source: Timetable
zh_hans: 时间表

source: Title
zh_hans: 标题

source: To properly load your content, please restart Sidekick.
zh_hans: 内容加载错误，请重启 Sidekick。

source: to start a conversation.
zh_hans: 开始对话。

source: Today
zh_hans: 今天

source: Todo
zh_hans: 待办清单

source: Toggle LaTeX
zh_hans: LaTeX 渲染开/关

source: Tokens
zh_hans: 令牌

source: tokens used%@
zh_hans: %@已使用令牌

source: Tool call results exceeding this token count will be summarized to save context space.
zh_hans: 超过此令牌数的工具调用结果将被汇总以节省上下文空间。

source: Toolbox
zh_hans: 工具箱

source: Total Tokens
zh_hans: 总令牌数

source: Translation
zh_hans: 翻译

source: Try a different search term
zh_hans: 请编辑搜索关键词

source: Try Tools
zh_hans: 试用工具

source: Type
zh_hans: 类别

source: Unknown
zh_hans: 未知

source: Unknown Source
zh_hans: 资料来源不明

source: Update Index
zh_hans: 更新索引

source: Updating resource index for expert "%@"
zh_hans: 正在扫描新添加到“%@”的资源

source: Usage
zh_hans: 使用次数

source: Use a vision capable local model.
zh_hans: 使用具备视觉能力的本地模型。

source: Use Completions
zh_hans: 使用文本续写

source: Use Default
zh_hans: 重置

source: Use Defaults
zh_hans: 恢复默认设置

source: Use Functions
zh_hans: 使用函数

source: Use GGUF model
zh_hans: 使用 GGUF 模型

source: Use GPU Acceleration
zh_hans: 使用 GPU

source: Use knowledge graphs to enhance retrieval with entity relationships and hierarchical communities. This provides better context but requires re-indexing.
zh_hans: 使用知识图谱通过实体关系和层级社区来增强检索。这可以提供更好的上下文，但需要重新索引。

source: Use knowledge graphs to enhance retrieval with entity relationships.
zh_hans: 使用知识图谱通过实体关系来增强检索。

source: Use Memory
zh_hans: 启用记忆

source: Use model server
zh_hans: 使用服务器上的模型

source: Use popular inference providers like OpenAI, Anthropic, or Groq.
zh_hans: 使用流行的推理端点，如 OpenAI、Anthropic 或 Groq。

source: Use Remote Model
zh_hans: 使用远端模型

source: Use Search
zh_hans: 启用搜索

source: Use Speculative Decoding
zh_hans: 使用推测性解码

source: Use the default keyboard shortcut `Command 􀆔 + Control 􀆍 + I` to toggle commands.
zh_hans: 使用默认键盘快捷键 `Command 􀆔 + Control 􀆍 + I` 开启助手。

source: Use the default keyboard shortcut `Tab` to accept suggestions for the next word, or `Shift + Tab` to accept all suggested words.
zh_hans: 使用默认键盘快捷键 `Tab` 接受下一个字，或使用 `Shift + Tab` 接受整段文字。

source: Use typing completions to speed up composition. Instead of typing out a word, just press 'Tab' to complete it.
zh_hans: 使用输入完成功能来加快撰写速度。与其输入整个单词，只需按下“Tab”键即可完成它。

source: Use Vision
zh_hans: 使用视觉

source: Use Vision Capabilities
zh_hans: 启用视觉输入

source: Use Web Search
zh_hans: 启用网络搜索

source: Use web search to allow the chatbot to respond with up-to-date information.
zh_hans: 启用网络搜索，让聊天机器人利用最新信息。

source: Used to access the Tavily API if the main API key fails.
zh_hans: 如果主 API 密钥访问失败，会被用于访问 Tavily API。

source: Username
zh_hans: 用户名

source: Uses
zh_hans: 使用次数

source: Value
zh_hans: 参数

source: View Experts
zh_hans: 查看专家

source: View Progress
zh_hans: 查看进度

source: View Reference
zh_hans: 查看资源

source: View usage statistics and trends
zh_hans: 查看使用情况统计数据和趋势

source: Vision
zh_hans: 视觉

source: Visualize a student's daily activities with a journey chart.
zh_hans: 请使用旅程图表可视化学生的日常活动。用旅程图表可视化学生的日常活动。

source: Voice
zh_hans: 声音

source: Von Neumann Architecture
zh_hans: 冯·诺依曼架构

source: Warning
zh_hans: 警告

source: Water Cycle
zh_hans: 水循环

source: Web
zh_hans: 搜索工具

source: Website
zh_hans: 网页

source: Welcome to Sidekick
zh_hans: 欢迎使用 Sidekick

source: What do you want Sidekick to respond with?
zh_hans: 你需要 Sidekick 以什么形式回复？

source: What type of resource do you want to add?
zh_hans: 你要添加的资源属于哪一类？

source: Worker Model: %@
zh_hans: 本地极速模型：%@

source: Write a command
zh_hans: 编写命令

source: Write a Unix command to
zh_hans: 编写 Unix 命令，以

source: Write an email to
zh_hans: 写电子邮件，告诉

source: Write email
zh_hans: 写邮件

source: Write initial draft
zh_hans: 撰写初稿

source: Wrong files selected. Please select the file "%@".
zh_hans: 选择的文件错误。请选取文件“￼%@”。

source: Yes
zh_hans: 确认

source: Your
zh_hans: 你的

source: Your file will be saved to this folder
zh_hans: 你的文件将被保存到此文件夹

source: your preferences so it can be more helpful.
zh_hans: 其他细节，以便能更有效地帮助你。

source: Your site will be saved to this folder
zh_hans: 你的网页将被保存到此文件夹

source: Your slides will be saved to this folder
zh_hans: 您的幻灯片将被保存到此文件夹
